/**
 * Created by Administrator on 16-11-17.
 */
var skills=[{
    skill:'html',
    level:'90%'
},{
    skill:'html5',
    level:'80%'
},{
    skill:'css2',
    level:'88%'
},{
    skill:'css3',
    level:'70%'
},{
    skill:'bootstrap',
    level:'70%'
},{
    skill:'javascript',
    level:'80%'
},{
    skill:'jquery',
    level:'80%'
},{
    skill:'angularjs',
    level:'45%'
},{
    skill:'nodejs',
    level:'50%'
},{
    skill:'c',
    level:'50%'
},{
    skill:'c#',
    level:'60%'
},{
    skill:'.net',
    level:'60%'
}];
var cons=[{
    method:'QQ',
    url:' <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" preserveAspectRatio="xMidYMid" width="28.031" height="30" viewBox="0 0 28.031 30">\
            <defs>\
            <style>\
             .cls-1 {\
             fill: #000;\
             fill-rule: evenodd;\
             }\
             </style>\
            </defs>\
           <path d="M28.003,20.031 C27.355,16.375 24.633,13.980 24.633,13.980 C25.022,10.661 23.596,10.072 23.596,10.072 C23.296,-0.197 14.202,-0.018 14.010,-0.013 C13.819,-0.018 4.723,-0.197 4.425,10.072 C4.425,10.072 2.999,10.661 3.388,13.980 C3.388,13.980 0.666,16.375 0.018,20.031 C0.018,20.031 -0.328,26.208 3.129,20.787 C3.129,20.787 3.906,22.846 5.332,24.695 C5.332,24.695 2.783,25.536 2.999,27.721 C2.999,27.721 2.912,30.157 8.442,29.990 C8.442,29.990 12.330,29.696 13.497,28.099 L14.006,28.099 L14.015,28.099 L14.524,28.099 C15.691,29.696 19.579,29.990 19.579,29.990 C25.107,30.157 25.022,27.721 25.022,27.721 C25.237,25.536 22.689,24.695 22.689,24.695 C24.115,22.846 24.892,20.787 24.892,20.787 C28.347,26.208 28.003,20.031 28.003,20.031 Z" class="cls-1"/>\
          </svg>',
    content:'501894188/501894188@qq.com'
},{
    method:'weChat',
    url:'<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" preserveAspectRatio="xMidYMid" width="36.969" height="29.031" viewBox="0 0 36.969 29.031">\
            <defs>\
               <style>\
                 .cls-1 {\
                   fill: #000;\
                  fill-rule: evenodd;\
                    }\
              </style>\
           </defs>\
           <path d="M32.399,25.866 L33.384,29.018 L29.793,27.124 C28.483,27.440 27.168,27.755 25.865,27.755 C19.636,27.755 14.731,23.656 14.731,18.609 C14.731,13.568 19.636,9.459 25.865,9.459 C31.747,9.459 36.984,13.568 36.984,18.609 C36.984,21.451 35.026,23.968 32.399,25.866 ZM22.256,14.509 C21.604,14.509 20.947,15.142 20.947,15.769 C20.947,16.407 21.604,17.031 22.256,17.031 C23.246,17.031 23.893,16.407 23.893,15.769 C23.893,15.142 23.246,14.509 22.256,14.509 ZM29.456,14.509 C28.809,14.509 28.155,15.142 28.155,15.769 C28.155,16.407 28.809,17.031 29.456,17.031 C30.437,17.031 31.094,16.407 31.094,15.769 C31.094,15.142 30.437,14.509 29.456,14.509 ZM13.908,18.760 C13.908,19.675 14.056,20.558 14.312,21.401 C13.908,21.432 13.501,21.451 13.090,21.451 C11.456,21.451 10.142,21.130 8.504,20.819 L3.929,23.028 L5.238,19.237 C1.960,17.031 0.001,14.187 0.001,10.726 C0.001,4.728 5.894,0.004 13.090,0.004 C19.527,0.004 25.165,3.778 26.298,8.856 C25.881,8.812 25.461,8.783 25.037,8.783 C18.818,8.783 13.908,13.252 13.908,18.760 ZM8.837,5.365 C7.856,5.365 6.866,5.989 6.866,6.938 C6.866,7.883 7.856,8.516 8.837,8.516 C9.819,8.516 10.471,7.883 10.471,6.938 C10.471,5.989 9.819,5.365 8.837,5.365 ZM17.998,5.365 C17.017,5.365 16.034,5.989 16.034,6.938 C16.034,7.883 17.017,8.516 17.998,8.516 C18.984,8.516 19.636,7.883 19.636,6.938 C19.636,5.989 18.984,5.365 17.998,5.365 Z" class="cls-1"/>\
         </svg>',
    content:'<img width="150" src="weChatCode.png"/>'
},{
    method:'github',
    url:'<svg aria-hidden="true"  height="28" version="1.1" viewBox="0 0 16 16" width="28"><path fill-rule="evenodd" d="M8 0C3.58 0 0 3.58 0 8c0 3.54 2.29 6.53 5.47 7.59.4.07.55-.17.55-.38 0-.19-.01-.82-.01-1.49-2.01.37-2.53-.49-2.69-.94-.09-.23-.48-.94-.82-1.13-.28-.15-.68-.52-.01-.53.63-.01 1.08.58 1.23.82.72 1.21 1.87.87 2.33.66.07-.52.28-.87.51-1.07-1.78-.2-3.64-.89-3.64-3.95 0-.87.31-1.59.82-2.15-.08-.2-.36-1.02.08-2.12 0 0 .67-.21 2.2.82.64-.18 1.32-.27 2-.27.68 0 1.36.09 2 .27 1.53-1.04 2.2-.82 2.2-.82.44 1.1.16 1.92.08 2.12.51.56.82 1.27.82 2.15 0 3.07-1.87 3.75-3.65 3.95.29.25.54.73.54 1.48 0 1.07-.01 1.93-.01 2.2 0 .21.15.46.55.38A8.013 8.013 0 0 0 16 8c0-4.42-3.58-8-8-8z"></path></svg>',
    content:'<a href="https://github.com/ddcouples">github:https://github.com/ddcouples</a>'
}, {
    method:'博客园',
    url:'<img width="30" src="logo_small.gif"/>',
    content:'<a href="http://www.cnblogs.com/ddcouples/">cnblog:http://www.cnblogs.com/ddcouples</a>'
}, {
    method:'资助',
    url:'<svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"  width="30px" height="30px"\
                  viewBox="0 0 16 16" style="enable-background:new 0 0 16 16;" xml:space="preserve">\
                       <path style="fill-rule:evenodd;clip-rule:evenodd;" d="M16,8c0-4.418-3.582-8-8-8C3.582,0,0,3.582,0,8c0,4.418,3.582,8,8,8\
                     C12.418,16,16,12.418,16,8z M6.957,10.316C6.75,10.074,6.598,9.7,6.5,9.195l0.661-0.162c0.09,0.357,0.2,0.612,0.331,0.765\
                    c0.136,0.146,0.318,0.219,0.544,0.219c0.221,0,0.405-0.083,0.553-0.25c0.146-0.164,0.219-0.377,0.219-0.638\
                    c0-0.233-0.061-0.419-0.183-0.56C8.563,8.499,8.471,8.422,8.35,8.337c-0.121-0.086-0.276-0.179-0.465-0.28\
                    C7.497,7.852,7.241,7.664,7.119,7.492C6.925,7.236,6.828,6.93,6.828,6.572c0-0.169,0.023-0.327,0.069-0.472\
                    c0.046-0.146,0.113-0.278,0.2-0.396S7.292,5.482,7.42,5.395C7.548,5.308,7.693,5.24,7.856,5.191V4.5h0.526v0.691\
                    c0.236,0.045,0.43,0.136,0.58,0.275c0.15,0.139,0.294,0.351,0.43,0.638L8.806,6.488C8.629,6.112,8.399,5.924,8.114,5.924\
                    c-0.176,0-0.323,0.061-0.439,0.183C7.559,6.229,7.501,6.382,7.501,6.565c0,0.167,0.047,0.305,0.141,0.416\
                    c0.092,0.108,0.279,0.236,0.559,0.384C8.444,7.495,8.644,7.616,8.803,7.73C8.961,7.844,9.08,7.954,9.16,8.06\
                    C9.387,8.347,9.5,8.693,9.5,9.1c0,0.399-0.102,0.752-0.307,1.057C8.991,10.46,8.72,10.665,8.382,10.77v0.73H7.856v-0.708\
                    C7.463,10.716,7.163,10.558,6.957,10.316z"/></svg>',
    content:'<img width="150" src="pay.jpg"/>'
}];

var projects=[{
    name:'写字',
    url:'https://ddcouples.github.io/writeWord/',
    img:'writeWord.png'
},{
    name:'中秋节礼物(手机端)',
    url:'https://ddcouples.github.io/zhongqiuPlus/',
    img:'zhongqiujie.jpg'
},{
    name:'五子棋（仿慕课)',
    url:'https://ddcouples.github.io/fiveInARow/',
    img:'fiveInRow.jpg'
},{
    name:'2048 军队版',
    url:'https://ddcouples.github.io/2048/#page2048',
    img:'2048.jpg'
},{
    name:'光柱小插件',
    url:'https://ddcouples.github.io/streamer/',
    img:'streamer.jpg'
}];
function randomCol(){
    var r=Math.ceil(Math.random()*255);
    var g=Math.ceil(Math.random()*255);
    var b=Math.ceil(Math.random()*255);
    return 'rgb('+r+','+g+','+b+')';
}
//给技能条添加样式
function skillsAnimate() {
    var $_scroll_bar = $('.scroll_bar');
    $_scroll_bar.each(function (index, item) {
        var bcolor = randomCol();
        var $_i = $(item).find('i');
        $_i.css({
            width: '0',
            'backgroundColor': bcolor
        })
        $_i.animate({
            'width': skills[index].level
        }, 5000)
    });
}
//添加connection内容
function addConnection(){
    var $_con_center=$('.con_center');
    var _content=$_con_center.html().toString();
    // <div>{{url}} {{method}}<div class="con_content">{{content}}</div></div>
    var _conAarry=[];
    for(index in cons){
       var _con= _content.replace(/\{\{url\}\}/,cons[index].url).replace(/\{\{method\}\}/,cons[index].method).replace(/\{\{content\}\}/,cons[index].content);
        _conAarry.push(_con);
    }
    $_con_center.html(_conAarry.join(' '));
}